Wire elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Fabric Sheet Type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoSurfPatternOnWire { get; }
  Visual Basic
Public Shared ReadOnly Property NoSurfPatternOnWire As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoSurfPatternOnWire {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricFailures Class
  Autodesk.Revit.DB Namespace